In [2]:
import pandas as pd

In [3]:
data = [100, 200, 300, 400, 500] 
series1 = pd.Series(data)
series1

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [4]:
series2 = pd.Series(data,index=["a","b","c","d","e"])
series2

a    100
b    200
c    300
d    400
e    500
dtype: int64

In [6]:
# data frames 
data1 = {'teams':['teamA','teamB'],'Runs':[250,300],'Wickets':[6,8]}
df = pd.DataFrame(data1)
df

   teams  Runs  Wickets
0  teamA   250        6
1  teamB   300        8

In [7]:
# Accessing column 
df['Runs']

0    250
1    300
Name: Runs, dtype: int64

In [ ]:
# Accessing row
df.loc[1]

teams      teamB
Runs         300
Wickets        8
Name: 1, dtype: object

In [10]:
# Accessing specic element 
print(df.loc[0,"Runs"])

250

In [11]:
print(df.iloc[1])

teams      teamB
Runs         300
Wickets        8
Name: 1, dtype: object

In [12]:
# slicing the data frame 
print(df[1:])

   teams  Runs  Wickets
1  teamB   300        8

In [16]:
# conditional filtering 
print(df[df["Runs"]>150])

   teams  Runs  Wickets
0  teamA   250        6
1  teamB   300        8

In [19]:
# Arthmatic operations in pandas 
df["Runs"] = df["Runs"]+15
df

   teams  Runs  Wickets
0  teamA   280        6
1  teamB   330        8

In [20]:
# Summerizing the data 
df.describe()

             Runs   Wickets
count    2.000000  2.000000
mean   305.000000  7.000000
std     35.355339  1.414214
min    280.000000  6.000000
25%    292.500000  6.500000
50%    305.000000  7.000000
75%    317.500000  7.500000
max    330.000000  8.000000

In [24]:
# Aggrigate functions
print(df['Runs'].sum())
print(df['Runs'].mean())
print(df['Runs'].min())
print(df['Runs'].max())

610
305.0
280
330

In [27]:
# Reading Csv file
Actor_df = pd.read_csv(r"C:\Users\heman\Desktop\chat gpt\data\actor.csv")
Actor_df

     actor_id first_name     last_name          last_update
0           1   PENELOPE       GUINESS  2006-02-15 04:34:33
1           2       NICK      WAHLBERG  2006-02-15 04:34:33
2           3         ED         CHASE  2006-02-15 04:34:33
3           4   JENNIFER         DAVIS  2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33
..        ...        ...           ...                  ...
195       196       BELA        WALKEN  2006-02-15 04:34:33
196       197      REESE          WEST  2006-02-15 04:34:33
197       198       MARY        KEITEL  2006-02-15 04:34:33
198       199      JULIA       FAWCETT  2006-02-15 04:34:33
199       200      THORA        TEMPLE  2006-02-15 04:34:33

[200 rows x 4 columns]

In [31]:
Actor_df.isna()

     actor_id  first_name  last_name  last_update
0       False       False      False        False
1       False       False      False        False
2       False       False      False        False
3       False       False      False        False
4       False       False      False        False
..        ...         ...        ...          ...
195     False       False      False        False
196     False       False      False        False
197     False       False      False        False
198     False       False      False        False
199     False       False      False        False

[200 rows x 4 columns]

In [32]:
Actor_df.dropna()

     actor_id first_name     last_name          last_update
0           1   PENELOPE       GUINESS  2006-02-15 04:34:33
1           2       NICK      WAHLBERG  2006-02-15 04:34:33
2           3         ED         CHASE  2006-02-15 04:34:33
3           4   JENNIFER         DAVIS  2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33
..        ...        ...           ...                  ...
195       196       BELA        WALKEN  2006-02-15 04:34:33
196       197      REESE          WEST  2006-02-15 04:34:33
197       198       MARY        KEITEL  2006-02-15 04:34:33
198       199      JULIA       FAWCETT  2006-02-15 04:34:33
199       200      THORA        TEMPLE  2006-02-15 04:34:33

[200 rows x 4 columns]

In [33]:
Actor_df.fillna(0)

     actor_id first_name     last_name          last_update
0           1   PENELOPE       GUINESS  2006-02-15 04:34:33
1           2       NICK      WAHLBERG  2006-02-15 04:34:33
2           3         ED         CHASE  2006-02-15 04:34:33
3           4   JENNIFER         DAVIS  2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33
..        ...        ...           ...                  ...
195       196       BELA        WALKEN  2006-02-15 04:34:33
196       197      REESE          WEST  2006-02-15 04:34:33
197       198       MARY        KEITEL  2006-02-15 04:34:33
198       199      JULIA       FAWCETT  2006-02-15 04:34:33
199       200      THORA        TEMPLE  2006-02-15 04:34:33

[200 rows x 4 columns]